Revit 2027 API
PrimitiveType Enumeration
 Type of geometry primitive represented as a number.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PrimitiveType
Public Enumeration PrimitiveType
public enum class PrimitiveType
type PrimitiveType
Members
Member name | Value | Description
LineList | 1 |  Geometry consisting of a list of line segments.
PointList | 2 |  Geometry consisting of a list of points.
TriangleList | 0 |  Geometry consisting of a list of triangles.
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace